In [6]:
import pandas as pd
import numpy as np
from pandas_profiling import ProfileReport
data = pd.read_csv('merged_data.csv')
data.head()

,avg_monthly_hrs,dept_id,filed_complaint,last_evaluation,n_projects,recently_promoted,salary,satisfaction,status,tenure,employee_id,dept_name,dept_head,age,gender,marital_status
0,246.0,NaN,NaN,0.866838,6,NaN,medium,0.134415,Left,4.0,124467,NaN,NaN,42.0,Female,Married
1,134.0,NaN,NaN,0.555718,2,NaN,low,0.511041,Left,3.0,112210,NaN,NaN,23.0,Female,Unmarried
2,156.0,D00-SS,1.0,0.474082,2,NaN,medium,0.405101,Left,3.0,126150,Sales,Edward J Bayley,24.0,Female,Unmarried
3,256.0,D00-SP,NaN,0.961360,6,NaN,low,0.152974,Left,4.0,125346,Support,Amelia Westray,51.0,Female,Married
4,146.0,D00-SS,NaN,0.507349,2,NaN,medium,0.434845,Left,3.0,113707,Sales,Edward J Bayley,23.0,Female,Unmarried

# performing steps to clean the data

- TP in department  - has nt meaningful info, but few rows are blank
- Avg monthly hours has no blanks
- Employee ID has 5 zeros? removed
- Duplicate records- clean  - 
- Blank dept ID  707? others OT
- Filled complaint column all blanks converted to 0
- last_eval column- average rating for 0
- recently_promoted blanks to 0
- how to treat tenure above 10 years age less than 30 - 400 such people
- satisfaction blanks to average for now
- tenure blanks converted to 1

In [2]:
#pip install pandas-profiling
#profile = ProfileReport(data, title = 'Profile_report')
#profile

In [14]:
#getting an understanding on the dept_id column
print(data['dept_id'].isnull())
data.loc[data['dept_id'].isnull()]

0         True
1         True
2        False
3        False
4        False
         ...
14145    False
14146    False
14147    False
14148    False
14149    False
Name: dept_id, Length: 14150, dtype: bool

,avg_monthly_hrs,dept_id,filed_complaint,last_evaluation,n_projects,recently_promoted,salary,satisfaction,status,tenure,employee_id,dept_name,dept_head,age,gender,marital_status
0,246.0,NaN,NaN,0.866838,6,NaN,medium,0.134415,Left,4.0,124467,NaN,NaN,42.0,Female,Married
1,134.0,NaN,NaN,0.555718,2,NaN,low,0.511041,Left,3.0,112210,NaN,NaN,23.0,Female,Unmarried
25,155.0,NaN,NaN,0.464598,2,NaN,medium,0.414451,Left,3.0,127792,NaN,NaN,23.0,Female,Unmarried
28,156.0,NaN,NaN,NaN,2,NaN,medium,0.465747,Left,3.0,128509,NaN,NaN,25.0,Female,Unmarried
40,233.0,NaN,NaN,0.965382,5,NaN,medium,0.962314,Left,5.0,125077,NaN,NaN,22.0,Female,Unmarried
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
14023,187.0,NaN,NaN,0.665927,2,NaN,low,0.414367,Employed,3.0,109640,NaN,NaN,23.0,Male,Unmarried
14036,250.0,NaN,NaN,0.995384,3,NaN,medium,0.928952,Employed,3.0,119098,NaN,NaN,24.0,Female,Unmarried
14057,247.0,NaN,NaN,0.373122,3,NaN,medium,0.186189,Employed,4.0,111995,NaN,NaN,25.0,Female,Unmarried
14088,230.0,NaN,NaN,NaN,4,NaN,medium,0.903135,Employed,3.0,106592,NaN,NaN,39.0,Male,Married
14109,139.0,NaN,NaN,0.397772,3,1.0,medium,0.554280,Employed,8.0,101864,NaN,NaN,24.0,Male,Unmarried

In [15]:
#tackling dept_id clumn... 5% of the data is nan hence converting to D00-OT.
data['dept_id'].fillna('D00-OT', inplace = True)
data

,avg_monthly_hrs,dept_id,filed_complaint,last_evaluation,n_projects,recently_promoted,salary,satisfaction,status,tenure,employee_id,dept_name,dept_head,age,gender,marital_status
0,246.0,D00-OT,NaN,0.866838,6,NaN,medium,0.134415,Left,4.0,124467,NaN,NaN,42.0,Female,Married
1,134.0,D00-OT,NaN,0.555718,2,NaN,low,0.511041,Left,3.0,112210,NaN,NaN,23.0,Female,Unmarried
2,156.0,D00-SS,1.0,0.474082,2,NaN,medium,0.405101,Left,3.0,126150,Sales,Edward J Bayley,24.0,Female,Unmarried
3,256.0,D00-SP,NaN,0.961360,6,NaN,low,0.152974,Left,4.0,125346,Support,Amelia Westray,51.0,Female,Married
4,146.0,D00-SS,NaN,0.507349,2,NaN,medium,0.434845,Left,3.0,113707,Sales,Edward J Bayley,23.0,Female,Unmarried
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
14145,245.0,D00-SS,NaN,0.850785,6,NaN,medium,0.225084,Employed,5.0,101809,Sales,Edward J Bayley,45.0,Female,Married
14146,192.0,D00-SS,NaN,0.951901,3,NaN,medium,0.539834,Employed,3.0,116153,Sales,Edward J Bayley,22.0,Female,Unmarried
14147,175.0,D00-MN,NaN,0.854538,4,NaN,medium,0.934465,Employed,3.0,119780,Management,Ellie Trafton,25.0,Male,Unmarried
14148,268.0,D00-MT,NaN,0.900887,5,NaN,medium,0.906613,Left,5.0,115325,Marketing,Reuben Swann,50.0,Male,Married
14149,268.0,D00-IT,1.0,0.897098,2,NaN,low,0.459371,Employed,4.0,112312,IT,Henry Adey,24.0,Male,Unmarried

In [16]:
#taking a look at the employee_id column in relation to the entire data-set
data[data['employee_id'] == 0]
#since their age gender and marital status columns are missing - considering dropping
#also not expected to improve or cause significant problems as it is only 5 rows

,avg_monthly_hrs,dept_id,filed_complaint,last_evaluation,n_projects,recently_promoted,salary,satisfaction,status,tenure,employee_id,dept_name,dept_head,age,gender,marital_status
34,284.0,D00-SS,NaN,0.852702,6,NaN,low,0.069168,Left,4.0,0,Sales,Edward J Bayley,NaN,NaN,NaN
304,264.0,D00-ENG,NaN,0.774554,6,NaN,low,0.110974,Left,4.0,0,Engineering,Sushant Raghunathan K,NaN,NaN,NaN
1234,129.0,D00-SP,NaN,0.402660,2,NaN,medium,0.437359,Left,3.0,0,Support,Amelia Westray,NaN,NaN,NaN
11304,167.0,D00-OT,NaN,0.880053,5,NaN,low,0.682140,Employed,3.0,0,NaN,NaN,NaN,NaN,NaN
12304,259.0,D00-ENG,NaN,0.505883,5,NaN,low,0.631046,Employed,4.0,0,Engineering,Sushant Raghunathan K,NaN,NaN,NaN

In [17]:
#tackling employee_id column removing those 5 rows with 0
data = data[data['employee_id'] != 0]  #only selecting those employee_id data which is not 0
data.shape

(14145, 16)

In [18]:
#tackling duplicate records
data = data.drop_duplicates()
data.shape

(14116, 16)

In [19]:
#tackling nans of filed_complaint column
data = pd.concat([data, pd.get_dummies(data['filed_complaint'], prefix = 'filed_complaint')], axis = 1)  #creating a new column using get_dummies
data.drop(['filed_complaint'], axis = 1, inplace = True) #dropped the original column
data.rename(columns ={'filed_complaint_1.0' : 'filed_complaint'}, inplace = True) #renamed the created column to the previous one
data.head()

,avg_monthly_hrs,dept_id,last_evaluation,n_projects,recently_promoted,salary,satisfaction,status,tenure,employee_id,dept_name,dept_head,age,gender,marital_status,filed_complaint
0,246.0,D00-OT,0.866838,6,NaN,medium,0.134415,Left,4.0,124467,NaN,NaN,42.0,Female,Married,0
1,134.0,D00-OT,0.555718,2,NaN,low,0.511041,Left,3.0,112210,NaN,NaN,23.0,Female,Unmarried,0
2,156.0,D00-SS,0.474082,2,NaN,medium,0.405101,Left,3.0,126150,Sales,Edward J Bayley,24.0,Female,Unmarried,1
3,256.0,D00-SP,0.961360,6,NaN,low,0.152974,Left,4.0,125346,Support,Amelia Westray,51.0,Female,Married,0
4,146.0,D00-SS,0.507349,2,NaN,medium,0.434845,Left,3.0,113707,Sales,Edward J Bayley,23.0,Female,Unmarried,0

In [20]:
#last_evaluation column  - all blanks to average rating
print(data['last_evaluation'].isnull().sum()) #figure correlates with the profiling report
data['last_evaluation'].fillna(data['last_evaluation'].mean(), inplace = True)
print(data['last_evaluation'].isnull().sum())  # we notice that now there are no nans
data.head() # a quick look at the data

1487
0

,avg_monthly_hrs,dept_id,last_evaluation,n_projects,recently_promoted,salary,satisfaction,status,tenure,employee_id,dept_name,dept_head,age,gender,marital_status,filed_complaint
0,246.0,D00-OT,0.866838,6,NaN,medium,0.134415,Left,4.0,124467,NaN,NaN,42.0,Female,Married,0
1,134.0,D00-OT,0.555718,2,NaN,low,0.511041,Left,3.0,112210,NaN,NaN,23.0,Female,Unmarried,0
2,156.0,D00-SS,0.474082,2,NaN,medium,0.405101,Left,3.0,126150,Sales,Edward J Bayley,24.0,Female,Unmarried,1
3,256.0,D00-SP,0.961360,6,NaN,low,0.152974,Left,4.0,125346,Support,Amelia Westray,51.0,Female,Married,0
4,146.0,D00-SS,0.507349,2,NaN,medium,0.434845,Left,3.0,113707,Sales,Edward J Bayley,23.0,Female,Unmarried,0

In [21]:
#tackling recently promoted_column - filling NaNs with 0
data['recently_promoted'] = data['recently_promoted'].fillna(0).apply(np.int64)
print(data['recently_promoted'].value_counts())  # we see that the data is skewed twoards not-promoted
data.head() #quick look at the data

0    13819
1      297
Name: recently_promoted, dtype: int64

,avg_monthly_hrs,dept_id,last_evaluation,n_projects,recently_promoted,salary,satisfaction,status,tenure,employee_id,dept_name,dept_head,age,gender,marital_status,filed_complaint
0,246.0,D00-OT,0.866838,6,0,medium,0.134415,Left,4.0,124467,NaN,NaN,42.0,Female,Married,0
1,134.0,D00-OT,0.555718,2,0,low,0.511041,Left,3.0,112210,NaN,NaN,23.0,Female,Unmarried,0
2,156.0,D00-SS,0.474082,2,0,medium,0.405101,Left,3.0,126150,Sales,Edward J Bayley,24.0,Female,Unmarried,1
3,256.0,D00-SP,0.961360,6,0,low,0.152974,Left,4.0,125346,Support,Amelia Westray,51.0,Female,Married,0
4,146.0,D00-SS,0.507349,2,0,medium,0.434845,Left,3.0,113707,Sales,Edward J Bayley,23.0,Female,Unmarried,0

In [22]:
#tackling the satisfaction column - treatment convert blanks to average
print(data['satisfaction'].isnull().sum())  #checking to see how many nulls
data['satisfaction'].fillna(data['satisfaction'].mean() , inplace = True) 
print(data['satisfaction'].isnull().sum()) #checking to see there are no nulls anymore
data.head() #quick look at the data

150
0

,avg_monthly_hrs,dept_id,last_evaluation,n_projects,recently_promoted,salary,satisfaction,status,tenure,employee_id,dept_name,dept_head,age,gender,marital_status,filed_complaint
0,246.0,D00-OT,0.866838,6,0,medium,0.134415,Left,4.0,124467,NaN,NaN,42.0,Female,Married,0
1,134.0,D00-OT,0.555718,2,0,low,0.511041,Left,3.0,112210,NaN,NaN,23.0,Female,Unmarried,0
2,156.0,D00-SS,0.474082,2,0,medium,0.405101,Left,3.0,126150,Sales,Edward J Bayley,24.0,Female,Unmarried,1
3,256.0,D00-SP,0.961360,6,0,low,0.152974,Left,4.0,125346,Support,Amelia Westray,51.0,Female,Married,0
4,146.0,D00-SS,0.507349,2,0,medium,0.434845,Left,3.0,113707,Sales,Edward J Bayley,23.0,Female,Unmarried,0

In [23]:
# tackling tenure blanks to be converted to 0
print(data['tenure'].isnull().sum())  #checking to see how many
data['tenure'].fillna(0, inplace = True)
print(data['tenure'].isnull().sum()) # all done
data.head()

150
0

,avg_monthly_hrs,dept_id,last_evaluation,n_projects,recently_promoted,salary,satisfaction,status,tenure,employee_id,dept_name,dept_head,age,gender,marital_status,filed_complaint
0,246.0,D00-OT,0.866838,6,0,medium,0.134415,Left,4.0,124467,NaN,NaN,42.0,Female,Married,0
1,134.0,D00-OT,0.555718,2,0,low,0.511041,Left,3.0,112210,NaN,NaN,23.0,Female,Unmarried,0
2,156.0,D00-SS,0.474082,2,0,medium,0.405101,Left,3.0,126150,Sales,Edward J Bayley,24.0,Female,Unmarried,1
3,256.0,D00-SP,0.961360,6,0,low,0.152974,Left,4.0,125346,Support,Amelia Westray,51.0,Female,Married,0
4,146.0,D00-SS,0.507349,2,0,medium,0.434845,Left,3.0,113707,Sales,Edward J Bayley,23.0,Female,Unmarried,0

In [24]:
data.info()
#seems like all the data points are tackled except for dept_head & dept_name which we really dont need

<class 'pandas.core.frame.DataFrame'>
Int64Index: 14116 entries, 0 to 14120
Data columns (total 16 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   avg_monthly_hrs    14116 non-null  float64
 1   dept_id            14116 non-null  object
 2   last_evaluation    14116 non-null  float64
 3   n_projects         14116 non-null  int64
 4   recently_promoted  14116 non-null  int64
 5   salary             14116 non-null  object
 6   satisfaction       14116 non-null  float64
 7   status             14116 non-null  object
 8   tenure             14116 non-null  float64
 9   employee_id        14116 non-null  int64
 10  dept_name          13203 non-null  object
 11  dept_head          13203 non-null  object
 12  age                14116 non-null  float64
 13  gender             14116 non-null  object
 14  marital_status     14116 non-null  object
 15  filed_complaint    14116 non-null  uint8
dtypes: float64(5), int64(3), object(7), uint8(1)
memory usage: 1.7+ MB

In [25]:
#looking at department ID see the unique value
data['dept_id'].value_counts()
#it seems to me that all the data belongs to the IT depatment

D00-SS     3895
D00-ENG    2573
D00-SP     2108
D00-IT     1152
D00-PD      853
D00-MT      812
D00-FN      722
D00-OT      706
D00-MN      590
-IT         207
D00-AD      175
D00-PR      173
D00-TP      150
Name: dept_id, dtype: int64

In [26]:
#replacing data in dept_id column -IT with D00-IT
data['dept_id'].replace(to_replace = '-IT',value = 'D00-IT', inplace = True)  #locking on the data which as -IT and then replacing it with D00IT
data['dept_id'].value_counts()  #seems to be fine now

D00-SS     3895
D00-ENG    2573
D00-SP     2108
D00-IT     1359
D00-PD      853
D00-MT      812
D00-FN      722
D00-OT      706
D00-MN      590
D00-AD      175
D00-PR      173
D00-TP      150
Name: dept_id, dtype: int64

In [27]:
#department head seems to have no relevance hence droppping the column as well as dept_id & employee_id
#data.drop(['dept_head', 'dept_name', 'employee_id'], axis = 1, inplace = True)
data

,avg_monthly_hrs,dept_id,last_evaluation,n_projects,recently_promoted,salary,satisfaction,status,tenure,employee_id,dept_name,dept_head,age,gender,marital_status,filed_complaint
0,246.0,D00-OT,0.866838,6,0,medium,0.134415,Left,4.0,124467,NaN,NaN,42.0,Female,Married,0
1,134.0,D00-OT,0.555718,2,0,low,0.511041,Left,3.0,112210,NaN,NaN,23.0,Female,Unmarried,0
2,156.0,D00-SS,0.474082,2,0,medium,0.405101,Left,3.0,126150,Sales,Edward J Bayley,24.0,Female,Unmarried,1
3,256.0,D00-SP,0.961360,6,0,low,0.152974,Left,4.0,125346,Support,Amelia Westray,51.0,Female,Married,0
4,146.0,D00-SS,0.507349,2,0,medium,0.434845,Left,3.0,113707,Sales,Edward J Bayley,23.0,Female,Unmarried,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
14116,141.0,D00-SS,0.537866,3,0,low,0.610841,Employed,3.0,100833,Sales,Edward J Bayley,29.0,Male,Unmarried,0
14117,168.0,D00-SS,0.643553,3,0,low,0.489559,Employed,3.0,118090,Sales,Edward J Bayley,24.0,Female,Unmarried,0
14118,257.0,D00-SP,0.718322,3,0,medium,0.944942,Employed,3.0,106064,Support,Amelia Westray,27.0,Male,Unmarried,0
14119,242.0,D00-IT,0.836603,4,0,low,0.740136,Employed,2.0,113083,IT,Henry Adey,46.0,Male,Married,0
14120,171.0,D00-SP,0.907277,3,0,low,0.506658,Employed,3.0,104996,Support,Amelia Westray,22.0,Male,Unmarried,1

In [29]:
data.to_csv('clean_data.csv', index = False)
data.info()  # there are no missing values in the data any longer...yipee! except for dept_name and dept_head which we will be dropping in any case.

<class 'pandas.core.frame.DataFrame'>
Int64Index: 14116 entries, 0 to 14120
Data columns (total 16 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   avg_monthly_hrs    14116 non-null  float64
 1   dept_id            14116 non-null  object
 2   last_evaluation    14116 non-null  float64
 3   n_projects         14116 non-null  int64
 4   recently_promoted  14116 non-null  int64
 5   salary             14116 non-null  object
 6   satisfaction       14116 non-null  float64
 7   status             14116 non-null  object
 8   tenure             14116 non-null  float64
 9   employee_id        14116 non-null  int64
 10  dept_name          13203 non-null  object
 11  dept_head          13203 non-null  object
 12  age                14116 non-null  float64
 13  gender             14116 non-null  object
 14  marital_status     14116 non-null  object
 15  filed_complaint    14116 non-null  uint8
dtypes: float64(5), int64(3), object(7), uint8(1)
memory usage: 1.7+ MB